songs/pulledup.org
#+TITLE: Talking Heads - Pulled Up

* Lyrics
#+begin_example
[Intro]
Oh-oh-oh-uh-oh-oh-oh-ah!

[Verse 1]
Mommy, Daddy, come and look at me now
I'm a big man in a great big town
Years ago, who would believe it's true?
Goes to show what a little faith can do

[Pre-Chorus]
I was complaining, I was down in the dumps
I feel so strong now 'cause you pulled me up
Pulled me up, up, up, up, up, up, up, up!

[Chorus]
I slipped, and I got pulled, pulled up
I tripped, and then you pulled, you pulled me up
I slipped, and I got pulled, pulled up
I slipped, and then you pulled, you pulled me up

[Post-Chorus]
Pulled me up-up, pulled me up-up-up-ah!
Pulled me up, up, up, up, up, up, up, up!

[Verse 2]
I drift away to another land
Sleeping, dreaming, such a simple thing
I think of things that I might be
I see my name go down in history

[Pre-Chorus]
I was complaining, I was down in the dumps
I feel so strong now 'cause you pulled me up!
Pulled me up, up, up, up, up, up, up, up!

[Chorus]
I slipped, and I got pulled, pulled up
I tripped, and then you pulled, you pulled me up
I tripped, and I got pulled, pulled up
I slipped, and then you pulled, you pulled me up!

[Post-Chorus]
Pulled me up-up, pulled me up-up-up-ah!
Na-na-na-na-na-na-na-na-na-na-na-na
Pulled me up, up, up, up, up, up, up, up!

[Bridge]
I got up 'cause you pulled me up
I stood up 'cause you pulled me up
I got up and that was because you pulled me up
I got up in a little while, you pulled me up
Up, pulled me up, up, up, up, up, up, up, up!
Aye-ya-ya-ya-ya-ya-ya-ya-ya-ya-ya-ya
Pulled me up, up, up, up, up, up, up, up!
Aye-ya-ya-ya-ya-ya-ya-ya-ya-ya-ya-ya
[Verse 3]
I cast a shadow on the living room wall
Dark and savage with a profile so sharp
Keep that wonderful food on the table
There's really no hurry, I'll eat in a while

[Pre-Chorus]
I was complaining, I was down in the dumps
I feel so strong now 'cause you pulled me up!
Pulled me up, up, up, up, up, up, up, up!

[Chorus]
I slipped, and I got pulled, pulled up
I tripped, and then you pulled, you pulled me up
I slipped, and I got pulled, pulled up
I slipped, and then you pulled, you pulled me up!

[Post-Chorus]
Pulled me up-up, pulled me up-up-up, oh I got!
Ah-ya-ya-ya-ya-yeah
Pulled me up, up, up, up, up, up, up, up!
Ah-ya-ya-ya-ya-ya-ya-ya-ya-ya-ya-ya-ya-ya!
Pulled me up, up, up, up, up, up, up, up!
Ah-ya-ya-ya-ya-ya-ya-ya-ya-ya-ya!
Pulled me up, up, up, up, up, up, up, up!

#+end_example
