songs/pulledup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="no" xml:lang="no">
<head>
<!-- 2023-08-03 Thu 12:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Talking Heads - Pulled Up</title>
<meta name="author" content="Tarjei Bærland" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css" type="text/css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Talking Heads - Pulled Up</h1>

<div id="outline-container-org2cb77ad" class="outline-2">
<h2 id="org2cb77ad">Lyrics</h2>
<div class="outline-text-2" id="text-org2cb77ad">
<pre class="example" id="org6e299a9">
[Intro]
Oh-oh-oh-uh-oh-oh-oh-ah!

[Verse 1]
Mommy, Daddy, come and look at me now
I'm a big man in a great big town
Years ago, who would believe it's true?
Goes to show what a little faith can do

[Pre-Chorus]
I was complaining, I was down in the dumps
I feel so strong now 'cause you pulled me up
Pulled me up, up, up, up, up, up, up, up!

[Chorus]
I slipped, and I got pulled, pulled up
I tripped, and then you pulled, you pulled me up
I slipped, and I got pulled, pulled up
I slipped, and then you pulled, you pulled me up

[Post-Chorus]
Pulled me up-up, pulled me up-up-up-ah!
Pulled me up, up, up, up, up, up, up, up!

[Verse 2]
I drift away to another land
Sleeping, dreaming, such a simple thing
I think of things that I might be
I see my name go down in history

[Pre-Chorus]
I was complaining, I was down in the dumps
I feel so strong now 'cause you pulled me up!
Pulled me up, up, up, up, up, up, up, up!

[Chorus]
I slipped, and I got pulled, pulled up
I tripped, and then you pulled, you pulled me up
I tripped, and I got pulled, pulled up
I slipped, and then you pulled, you pulled me up!

[Post-Chorus]
Pulled me up-up, pulled me up-up-up-ah!
Na-na-na-na-na-na-na-na-na-na-na-na
Pulled me up, up, up, up, up, up, up, up!

[Bridge]
I got up 'cause you pulled me up
I stood up 'cause you pulled me up
I got up and that was because you pulled me up
I got up in a little while, you pulled me up
Up, pulled me up, up, up, up, up, up, up, up!
Aye-ya-ya-ya-ya-ya-ya-ya-ya-ya-ya-ya
Pulled me up, up, up, up, up, up, up, up!
Aye-ya-ya-ya-ya-ya-ya-ya-ya-ya-ya-ya
[Verse 3]
I cast a shadow on the living room wall
Dark and savage with a profile so sharp
Keep that wonderful food on the table
There's really no hurry, I'll eat in a while

[Pre-Chorus]
I was complaining, I was down in the dumps
I feel so strong now 'cause you pulled me up!
Pulled me up, up, up, up, up, up, up, up!

[Chorus]
I slipped, and I got pulled, pulled up
I tripped, and then you pulled, you pulled me up
I slipped, and I got pulled, pulled up
I slipped, and then you pulled, you pulled me up!

[Post-Chorus]
Pulled me up-up, pulled me up-up-up, oh I got!
Ah-ya-ya-ya-ya-yeah
Pulled me up, up, up, up, up, up, up, up!
Ah-ya-ya-ya-ya-ya-ya-ya-ya-ya-ya-ya-ya-ya!
Pulled me up, up, up, up, up, up, up, up!
Ah-ya-ya-ya-ya-ya-ya-ya-ya-ya-ya!
Pulled me up, up, up, up, up, up, up, up!

</pre>
</div>
</div>
</div>
</body>
</html>